artillery/scenario.yaml
config:
  target: "http://localhost:8010"
  phases:
    - duration: 30
      arrivalRate: 120
scenarios:
  - flow:
    - post:
        url: "/rides"
        json: 
          start_lat: 11
          start_long: 100
          end_lat: 79
          end_long: 120
          rider_name: "Rad"
          driver_name: "Matsumoto"
          driver_vehicle: "Honda"
    - get:
        url: "/rides"
    - get:
        url: "/rides/1"
    - get:
        url: "/health"



# Implement load testing using `artillery`
# 1. Create a PR against `master` of your fork including artillery
# 2. Ensure that load testing is able to be run using `npm test:load`. You can consider using a tool like `forever` to spin up a daemon and kill it after the load test has completed.
# 3. Test all endpoints under at least `100 rps` for `30s` and ensure that `p99` is under `50ms`