artillery/scenario.yaml
config:
  target: "http://localhost:8010"
  phases:
    - duration: 30
      arrivalRate: 120
scenarios:
  - flow:
    - post:
        url: "/rides"
        json: 
          start_lat: 11
          start_long: 100
          end_lat: 79
          end_long: 120
          rider_name: "Rad"
          driver_name: "Matsumoto"
          driver_vehicle: "Honda"
    - get:
        url: "/rides"
    - get:
        url: "/rides/1"
    - get:
        url: "/health"